#+STARTUP: fold
#+PROPERTY: header-args:ipython :results both :exports both :async yes :session lif :kernel dual_data
# #+PROPERTY: header-args:ipython :results both :exports both :async yes :session /ssh:172.26.20.46:~/.local/share/jupyter/runtime/kernel-343f5c4f-82fe-4da8-aa26-6dafafa92f96.json :kernel dual_data

** Settings
#+begin_src ipython
  %load_ext autoreload
  %autoreload 2
  %reload_ext autoreload

  %run /home/leon/models/lif_cpp/notebooks/setup.py
  %matplotlib inline
  %config InlineBackend.figure_format = 'png'
#+end_src

#+RESULTS:
: The autoreload extension is already loaded. To reload it, use:
:   %reload_ext autoreload
: Python exe
: /home/leon/mambaforge/envs/dual_data/bin/python

* Compilation

#+begin_src sh
  cd $HOME/models/lif_cpp
  # make clean
  make
#+end_src

#+RESULTS:
| g++ | -Wall | -std=c++17   | -Ofast        | -s                | -march=native | -funroll-loops   | -ftree-vectorize | -ffast-math | -fomit-frame-pointer | -fexpensive-optimizations | -lyaml-cpp    | -c             | src/lif_network.cpp | -o          | obj/lif_network.o    |                           |            |
| g++ | -o    | ./bin/LifNet | obj/globals.o | obj/lif_network.o | obj/main.o    | obj/sparse_mat.o | -Wall            | -std=c++17  | -Ofast               | -s                        | -march=native | -funroll-loops | -ftree-vectorize    | -ffast-math | -fomit-frame-pointer | -fexpensive-optimizations | -lyaml-cpp |

*** Jab and corr

#+begin_src ipython
  name = 'odr_Jee'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='Jab', gain=1.05, axis=0, IF_M0=1)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

#+begin_src ipython
  name = 'odr_Jei'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='Jab', gain=0.95, axis=1, IF_M0=0)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

#+begin_src ipython
  name = 'odr_Jie'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='Jab', gain=0.95, axis=2, IF_M0=1)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

#+begin_src ipython
  name = 'odr_corr'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='CORR_FF', gain=0.5, axis=-1, IF_M0=1)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

#+begin_src ipython
  name = 'odr_use'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='USE', gain=1.1, axis=0, IF_M0=1)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

#+begin_src ipython
  name = 'odr_tau_fac'
  run_ini_phi(conf_name, name, ini_list, phi_list, X_str='TAU_REC', gain=1.1, axis=0, IF_M0=1)
#+end_src

#+RESULTS:
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...
:  MEM_USAGE > 85.0%, sleeping for a while ...

